# Period Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Period Property
SpecTypeId Class See Also
---
Period, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Period { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Period As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Period {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace